zsf90/ClockLED/Code/GD32F130F8P6/Inc/ds1302.h
/**
 * @file ds1302.h
 * @author your name (you@domain.com)
 * @brief DS1302 时钟芯片
 * @version 0.1
 * @date 2022-03-11
 * 
 * @copyright Copyright (c) 2022
 * 
 * DS1302_CLK: PA0
 * DS1302_DIO: PA1
 * DS1302_RST: PA5
 */
#ifndef __DS1302_H
#define __DS1302_H

#include "gd32f1x0.h"

#define DS1302_CLK_RCU  RCU_GPIOA
#define DS1302_CLK_PIN  GPIO_PIN_0
#define DS1302_CLK_PORT     GPIOA

#define DS1302_DIO_RCU  RCU_GPIOA
#define DS1302_DIO_PIN  GPIO_PIN_1
#define DS1302_DIO_PORT     GPIOA

#define DS1302_RST_RCU  RCU_GPIOA
#define DS1302_RST_PIN  GPIO_PIN_5
#define DS1302_RST_PORT     GPIOA

#define DS1302_CLK_WRITE(x)     gpio_bit_write(DS1302_CLK_PORT, DS1302_CLK_PIN, x)
#define DS1302_DIO_WRITE(x)     gpio_bit_write(DS1302_DIO_PORT, DS1302_DIO_PIN, x)
#define DS1302_RST_WRITE(x)     gpio_bit_write(DS1302_RST_PORT, DS1302_RST_PIN, x)

#define DS1302_DIO_READ()       gpio_input_bit_get(DS1302_DIO_PORT, DS1302_DIO_PIN)

typedef enum
{
    SECOND=0,   /* 秒 */
    MINUTES,    /* 分钟 */
    HOUR,       /* 小时 */
    DAY,        /* 日 */
    MONTH,      /* 月 */
    WEEK,       /* 周 */
    YEAR,       /* 年 */
} ds1302_time_enum;

/**
 * @brief 函数声明 
 * 
 */
void ds1302_gpio_init(void);
void ds1302_init(void);
void ds1302_read_time(void);
void ds1302_write(uint8_t addr, uint8_t data);
uint8_t ds1302_read(uint8_t addr);


#endif // __DS1302_H
